# Дрэва адрэзкаў

|        Парамэтар        |   Значэньне   |
|  --------------------   | ------------- |
|  Імя ўваходнага файлу   |    in.txt     |
|   Імя выхаднога файлу   |    out.txt    |
|   Абмежаваньне па часе  |      1 с      |
|  Абмежаваньне па памяці |   Адсутнічае  |

Маецца пасьлядоўнасьць s0, …, sn − 1, якая складаецца з нулёў. На гэтай пасьлядоўнасьці могуць выконвацца запыты наступных тыпаў:

    Устанавіць значэньне sі роўным v.
    Дадаць да кожнага элемэнта зь індэксам з адрэзка [a, b] лік v.
    Знайсьці суму элемэнтаў зь індэксамі з адрэзка [a, b].
    Знайсьці мінімум сярод элемэнтаў зь індэксамі з адрэзка [a, b].
    Знайсьці максымум сярод элемэнтаў зь індэксамі з адрэзка [a, b].

Патрабуецца напісаць праграму, якая будзе апрацоўваць названыя запыты.

# Іnput
Першы радок зьмяшчае адзін цэлы лік n (1 ≤ n ≤ 300 000)— даўжыню пасьлядоўнасьці. Наступныя радкі маюць наступны фармат: першы лік — тып запыту (гл. умова), далей для запыту тыпу 1 два чысла: і, індэкс элемэнта ў масіве, і значэньне v; для запыту тыпу 2 тры лікі: a, b, v; для запытаў тыпу 3–5 два лікі: a і b. Уваход заканчваецца радком з адзіным лікам 0. Лік радкоў не пераўзыходзіць 300 003. Абсалютная велічыня ліку v у кожным запыце не перавышае 1 000 000. Лікі a, b і й у кожным запыце задавальняюць няроўнасьцям 0 ≉ ≉ < n.

# Output
Для кожнага запыту тыпу 3-5 выведзіце адказ на запыт.
